# ü¶æ Pandas Practice Session JCDSFT 0206

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')
df.head()

C:\Users\AUDIT-PC\AppData\Local\Temp\ipykernel_26888\3602967480.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# Get Last Name of employee üßë‚Äçüíº

In [3]:
df['LastName'] = df['EmployeeName'].str.split().str[-1]
df[['EmployeeName', 'LastName']].head()

        EmployeeName LastName
0     NATHANIEL FORD     FORD
1       GARY JIMENEZ  JIMENEZ
2     ALBERT PARDINI  PARDINI
3  CHRISTOPHER CHONG    CHONG
4    PATRICK GARDNER  GARDNER

In [21]:
def lastname(name):
    name = name.split()
    return name[-1]

df['LastName'] = df['EmployeeName'].apply(lastname)
df[['EmployeeName', 'LastName']].head()

        EmployeeName LastName
0     NATHANIEL FORD     FORD
1       GARY JIMENEZ  JIMENEZ
2     ALBERT PARDINI  PARDINI
3  CHRISTOPHER CHONG    CHONG
4    PATRICK GARDNER  GARDNER

# Try to impute base pay null values üíµ

In [ ]:
for col in ['BasePay', 'OvertimePay', 'OtherPay']:
    df[col] = pd.to_numeric(df[col], errors='coerce')

df['BasePay'] = df['BasePay'].fillna(df['TotalPay'] - df['OtherPay'] - df['OvertimePay'])
print(df[['EmployeeName', 'BasePay']].head())

        EmployeeName    BasePay
0     NATHANIEL FORD  167411.18
1       GARY JIMENEZ  155966.02
2     ALBERT PARDINI  212739.13
3  CHRISTOPHER CHONG   77916.00
4    PATRICK GARDNER  134401.60

# Count employee by job title ‚èèÔ∏è

In [22]:
top5_jobs = df['JobTitle'].value_counts().head().reset_index()
top5_jobs.columns = ['job title', 'count']
print(top5_jobs)

                      job title  count
0              Transit Operator   7036
1                 Special Nurse   4389
2              Registered Nurse   3736
3  Public Svc Aide-Public Works   2518
4              Police Officer 3   2421

# Count job title that have chief in job title üë®‚Äçüè≠

In [ ]:
df['chief'] = df['JobTitle'].str.contains('chief', case=False, na=False).astype(int)
chief_count = df.groupby('chief').size().reset_index(name='count')
print(chief_count)

   chief   count
0      0  148027
1      1     627

# Sum Total pay group by Year üé¥

In [12]:
total_pay_by_year = df.groupby('Year')['TotalPay'].sum()
print(total_pay_by_year)

Year
2011    2.594195e+09
2012    2.724848e+09
2013    2.918656e+09
2014    2.876911e+09
Name: TotalPay, dtype: float64